## Plan Result (sbox_landing - TerraformPlanApply)




<pre><code>Plan: 4 to add, 10 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0]
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0]
* Update
  * azurerm_container_group.runner[&#34;00dlrm-ingestionengine&#34;]
  * module.logic[&#34;00&#34;].azurerm_logic_app_standard.this
  * module.logic[&#34;00&#34;].azurerm_resource_group_template_deployment.sqlConn
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_windows_virtual_machine.winvm[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_group.runner["00dlrm-ingestionengine"] will be updated in-place
  ~ resource "azurerm_container_group" "runner" {
        id                          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.ContainerInstance/containerGroups/ingest00-runner-sbox"
        name                        = "ingest00-runner-sbox"
      ~ tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.logic["00"].azurerm_logic_app_standard.this will be updated in-place
  ~ resource "azurerm_logic_app_standard" "this" {
      ~ app_settings                   = {
          ~ "FUNCTIONS_WORKER_RUNTIME"          = "dotnet" -> "node"
            # (8 unchanged elements hidden)
        }
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Web/sites/ingest00-logic-sbox"
        name                           = "ingest00-logic-sbox"
        tags                           = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["00"].azurerm_resource_group_template_deployment.sqlConn will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "sqlConn" {
        id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Resources/deployments/logicapp-sql-conn-deployment"
        name                     = "logicapp-sql-conn-deployment"
      ~ output_content           = jsonencode({}) -> (known after apply)
      ~ parameters_content       = jsonencode(
          ~ {
              - location   = {
                  - value = "uksouth"
                }
                # (1 unchanged attribute hidden)
            }
        )
        tags                     = {}
        # (5 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-sbox"
        name                                                   = "ingest00-legacy-sql-sbox"
        tags                                                   = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (42 unchanged attributes hidden)

      + identity {
          + type = "SystemAssigned"
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.metadata_vault["meta002"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
      - enable_rbac_authorization       = true -> null
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-meta002-sbox"
        name                            = "ingest00-meta002-sbox"
        tags                            = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"
        name                               = "ingest00curatedsbox"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00externalsbox"
        name                               = "ingest00externalsbox"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00landingsbox"
        name                               = "ingest00landingsbox"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00rawsbox"
        name                               = "ingest00rawsbox"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00workspacesbox"
        name                               = "ingest00workspacesbox"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.windows_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "windows_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-windows-vm-logs"
      + description             = "Association between a windows VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = "vm-ingest00-legacy-sql-sbox-dcra"
      + target_resource_id      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-sbox"
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMAWindows"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + type                        = "AzureMonitorWindowsAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-sbox"
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Compute"
      + tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + type                        = "CustomScriptExtension"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-sbox"
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.endpoint_protection[0] will be created
  + resource "azurerm_virtual_machine_extension" "endpoint_protection" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AntiMalwareEndpointProtection"
      + publisher                   = "Microsoft.Azure.Security"
      + settings                    = <<-EOT
            {
                  "AntimalwareEnabled": "true",
                  "RealtimeProtectionEnabled": "true",
                  "ScheduledScanSettings": {"day":"7","isEnabled":"true","scanType":"Quick","time":"120"}
                }
        EOT
      + tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + type                        = "IaaSAntimalware"
      + type_handler_version        = "1.6"
      + virtual_machine_id          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-sbox"
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

Plan: 4 to add, 10 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":47,"Program":"tfcmt","SHA1":"","Target":"sbox_landing - TerraformPlanApply","Vars":{}} -->